In [1]:
import pandas as pd

In [2]:
with open('Social_Network_Ads.csv') as f:
    data = pd.read_csv(f)

In [3]:
print(data.head())

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
print(data.tail())

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
pd_data = data.copy()

In [7]:
print(pd_data.head())

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [8]:
pd_data.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [11]:
stats = pd.concat([pd_data.mean(), pd_data.std()], axis = 1)

C:\Users\User\AppData\Local\Temp\ipykernel_18880\68281364.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  stats = pd.concat([pd_data.mean(), pd_data.std()], axis = 1)

In [12]:
stats

                            0             1
User ID          1.569154e+07  71658.321581
Age              3.765500e+01     10.482877
EstimatedSalary  6.974250e+04  34096.960282
Purchased        3.575000e-01      0.479864

In [13]:
stats.columns = ['mean', 'std']

In [14]:
stats

                         mean           std
User ID          1.569154e+07  71658.321581
Age              3.765500e+01     10.482877
EstimatedSalary  6.974250e+04  34096.960282
Purchased        3.575000e-01      0.479864

In [16]:
pd_data.shape

(400, 5)

In [17]:
pd_data.corr()

                  User ID       Age  EstimatedSalary  Purchased
User ID          1.000000 -0.000721         0.071097   0.007120
Age             -0.000721  1.000000         0.155238   0.622454
EstimatedSalary  0.071097  0.155238         1.000000   0.362083
Purchased        0.007120  0.622454         0.362083   1.000000

In [18]:
pd_data.count()

User ID            400
Gender             400
Age                400
EstimatedSalary    400
Purchased          400
dtype: int64